Using TensorFlow backend.
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)        896
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 30, 30, 32)        9248
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 15, 15, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 15, 64)        18496
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 13, 13, 64)        36928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 64)          0
_________________________________________________________________
dropout_2 (Dropout)          (None, 6, 6, 64)          0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 6, 128)         73856
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 4, 4, 128)         147584
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 128)         0
_________________________________________________________________
dropout_3 (Dropout)          (None, 2, 2, 128)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_2 (Dense)              (None, 43)                22059
=================================================================
Total params: 571,723
Trainable params: 571,723
Non-trainable params: 0
_________________________________________________________________
Train on 25094 samples, validate on 6274 samples
Epoch 1/5
25094/25094 [==============================] - 33s 1ms/step - loss: 2.4253 - accuracy: 0.3178 - val_loss: 0.5123 - val_accuracy: 0.8398
Epoch 2/5
25094/25094 [==============================] - 35s 1ms/step - loss: 0.4425 - accuracy: 0.8578 - val_loss: 0.1492 - val_accuracy: 0.9535
Epoch 3/5
25094/25094 [==============================] - 36s 1ms/step - loss: 0.2177 - accuracy: 0.9331 - val_loss: 0.0960 - val_accuracy: 0.9712
Epoch 4/5
25094/25094 [==============================] - 35s 1ms/step - loss: 0.1531 - accuracy: 0.9538 - val_loss: 0.0599 - val_accuracy: 0.9814
Epoch 5/5
25094/25094 [==============================] - 37s 1ms/step - loss: 0.1178 - accuracy: 0.9660 - val_loss: 0.0517 - val_accuracy: 0.9857